* PDF plot based on tag

#+name: test-block
#+begin_src python
print("hi")
#+end_src

#+name: pdf-plot
#+begin_src python
if "paper" in _tag_.split(":"):
    plt.savefig(f"{paperdir}/figures/{figure}.pdf", bbox_inches="tight")
if "analysis" in _tag_.split(":"):
    plt.savefig(f"{figure}.pdf", bbox_inches="tight")
#+end_src

** Example :paper:
:PROPERTIES:
:header-args: :var paperdir="~/tmp/scripts"
:header-args+: :var figure="test"
:header-args:python: :var "_tag_=(org-entry-get (point) \"TAGS\")"
:END:

#+begin_src sh
mkdir -p "$paperdir/figures"
#+end_src

#+RESULTS:

#+begin_src python
import matplotlib.pyplot as plt
plt.plot([1, 2])
plt.show()
<<pdf-plot>>
#+end_src

#+RESULTS:

#+begin_src sh
ls "$paperdir/figures"
#+end_src

#+RESULTS:
: test.pdf

* Python Imports

#+name: imports
#+begin_src python
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import figtex;figtex.style()
import os
os.environ["USE_PROPACK"] = "1"
import scipy.sparse as sp
from scipy.sparse import linalg as spla
from mpltools import annotation
#+end_src

